yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l101g3.h
/* TIM2 Capture/Compare enable register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CC1E        : 1;
  unsigned char CC1P        : 1;
  unsigned char             : 2;
  unsigned char CC2E        : 1;
  unsigned char CC2P        : 1;
} __BITS_TIM2_CCER1;
#endif
__IO_REG8_BIT(TIM2_CCER1,  0x525A, __READ_WRITE, __BITS_TIM2_CCER1);

/* TIM2 Counter high */
__IO_REG8    (TIM2_CNTRH,  0x525B, __READ_WRITE);
/* TIM2 Counter low */
__IO_REG8    (TIM2_CNTRL,  0x525C, __READ_WRITE);
/* TIM2 Prescaler register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PSC         : 3;
} __BITS_TIM2_PSCR;
#endif
__IO_REG8_BIT(TIM2_PSCR,   0x525D, __READ_WRITE, __BITS_TIM2_PSCR);

/* TIM2 Auto-reload register high */
__IO_REG8    (TIM2_ARRH,   0x525E, __READ_WRITE);
/* TIM2 Auto-reload register low */
__IO_REG8    (TIM2_ARRL,   0x525F, __READ_WRITE);
/* TIM2 Capture/Compare register 1 high */
__IO_REG8    (TIM2_CCR1H,  0x5260, __READ_WRITE);
/* TIM2 Capture/Compare register 1 low */
__IO_REG8    (TIM2_CCR1L,  0x5261, __READ_WRITE);
/* TIM2 Capture/Compare register 2 high */
__IO_REG8    (TIM2_CCR2H,  0x5262, __READ_WRITE);
/* TIM2 Capture/Compare register 2 low */
__IO_REG8    (TIM2_CCR2L,  0x5263, __READ_WRITE);
/* TIM2 Break register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LOCK        : 2;
  unsigned char OSSI        : 1;
  unsigned char             : 1;
  unsigned char BKE         : 1;
  unsigned char BKP         : 1;
  unsigned char AOE         : 1;
  unsigned char MOE         : 1;
} __BITS_TIM2_BKR;
#endif
__IO_REG8_BIT(TIM2_BKR,    0x5264, __READ_WRITE, __BITS_TIM2_BKR);

/* TIM2 Output idle state register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char OIS1        : 1;
  unsigned char             : 1;
  unsigned char PIS2        : 1;
} __BITS_TIM2_OISR;
#endif
__IO_REG8_BIT(TIM2_OISR,   0x5265, __READ_WRITE, __BITS_TIM2_OISR);


/*-------------------------------------------------------------------------
 *      TIM2 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define TIM2_CR1_CEN             TIM2_CR1_bit.CEN
#define TIM2_CR1_UDIS            TIM2_CR1_bit.UDIS
#define TIM2_CR1_URS             TIM2_CR1_bit.URS
#define TIM2_CR1_OPM             TIM2_CR1_bit.OPM
#define TIM2_CR1_DIR             TIM2_CR1_bit.DIR
#define TIM2_CR1_CMS             TIM2_CR1_bit.CMS
#define TIM2_CR1_ARPE            TIM2_CR1_bit.ARPE

#define TIM2_CR2_MMS             TIM2_CR2_bit.MMS

#define TIM2_SMCR_SMS            TIM2_SMCR_bit.SMS
#define TIM2_SMCR_TS             TIM2_SMCR_bit.TS
#define TIM2_SMCR_MSM            TIM2_SMCR_bit.MSM

#define TIM2_ETR_ETF             TIM2_ETR_bit.ETF
#define TIM2_ETR_ETPS            TIM2_ETR_bit.ETPS
#define TIM2_ETR_ECE             TIM2_ETR_bit.ECE
#define TIM2_ETR_ETP             TIM2_ETR_bit.ETP

#define TIM2_IER_UIE             TIM2_IER_bit.UIE
#define TIM2_IER_CC1IE           TIM2_IER_bit.CC1IE
#define TIM2_IER_CC2IE           TIM2_IER_bit.CC2IE
#define TIM2_IER_TIE             TIM2_IER_bit.TIE
#define TIM2_IER_BIE             TIM2_IER_bit.BIE

#define TIM2_SR1_UIF             TIM2_SR1_bit.UIF
#define TIM2_SR1_CC1IF           TIM2_SR1_bit.CC1IF
#define TIM2_SR1_CC2IF           TIM2_SR1_bit.CC2IF
#define TIM2_SR1_TIF             TIM2_SR1_bit.TIF
#define TIM2_SR1_BIF             TIM2_SR1_bit.BIF

#define TIM2_SR2_CC1OF           TIM2_SR2_bit.CC1OF
#define TIM2_SR2_CC2OF           TIM2_SR2_bit.CC2OF

#define TIM2_EGR_UG              TIM2_EGR_bit.UG
#define TIM2_EGR_CC1G            TIM2_EGR_bit.CC1G
#define TIM2_EGR_CC2G            TIM2_EGR_bit.CC2G
#define TIM2_EGR_TG              TIM2_EGR_bit.TG
#define TIM2_EGR_BG              TIM2_EGR_bit.BG

#define TIM2_CCMR1_CAPTURE_CC1S  TIM2_CCMR1_CAPTURE_bit.CC1S
#define TIM2_CCMR1_CAPTURE_IC1PSC TIM2_CCMR1_CAPTURE_bit.IC1PSC
#define TIM2_CCMR1_CAPTURE_IC1F  TIM2_CCMR1_CAPTURE_bit.IC1F

#define TIM2_CCMR1_COMPARE_CC1S  TIM2_CCMR1_COMPARE_bit.CC1S
#define TIM2_CCMR1_COMPARE_OC1FE TIM2_CCMR1_COMPARE_bit.OC1FE
#define TIM2_CCMR1_COMPARE_OC1PE TIM2_CCMR1_COMPARE_bit.OC1PE
#define TIM2_CCMR1_COMPARE_OC1M  TIM2_CCMR1_COMPARE_bit.OC1M

#define TIM2_CCMR2_CAPTURE_CC2S  TIM2_CCMR2_CAPTURE_bit.CC2S
#define TIM2_CCMR2_CAPTURE_IC2PSC TIM2_CCMR2_CAPTURE_bit.IC2PSC
#define TIM2_CCMR2_CAPTURE_IC2F  TIM2_CCMR2_CAPTURE_bit.IC2F

#define TIM2_CCMR2_COMPARE_CC2S  TIM2_CCMR2_COMPARE_bit.CC2S
#define TIM2_CCMR2_COMPARE_OC2FE TIM2_CCMR2_COMPARE_bit.OC2FE
#define TIM2_CCMR2_COMPARE_OC2PE TIM2_CCMR2_COMPARE_bit.OC2PE
#define TIM2_CCMR2_COMPARE_OC2M  TIM2_CCMR2_COMPARE_bit.OC2M

#define TIM2_CCER1_CC1E          TIM2_CCER1_bit.CC1E
#define TIM2_CCER1_CC1P          TIM2_CCER1_bit.CC1P
#define TIM2_CCER1_CC2E          TIM2_CCER1_bit.CC2E
#define TIM2_CCER1_CC2P          TIM2_CCER1_bit.CC2P

#define TIM2_PSCR_PSC            TIM2_PSCR_bit.PSC

#define TIM2_BKR_LOCK            TIM2_BKR_bit.LOCK
#define TIM2_BKR_OSSI            TIM2_BKR_bit.OSSI
#define TIM2_BKR_BKE             TIM2_BKR_bit.BKE
#define TIM2_BKR_BKP             TIM2_BKR_bit.BKP
#define TIM2_BKR_AOE             TIM2_BKR_bit.AOE
#define TIM2_BKR_MOE             TIM2_BKR_bit.MOE

#define TIM2_OISR_OIS1           TIM2_OISR_bit.OIS1
#define TIM2_OISR_PIS2           TIM2_OISR_bit.PIS2

#endif

/*-------------------------------------------------------------------------
 *      TIM2 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_TIM2_CR1_CEN        0x01
#define MASK_TIM2_CR1_UDIS       0x02
#define MASK_TIM2_CR1_URS        0x04
#define MASK_TIM2_CR1_OPM        0x08
#define MASK_TIM2_CR1_DIR        0x10
#define MASK_TIM2_CR1_CMS        0x60
#define MASK_TIM2_CR1_ARPE       0x80

#define MASK_TIM2_CR2_MMS        0x70

#define MASK_TIM2_SMCR_SMS       0x07
#define MASK_TIM2_SMCR_TS        0x70
#define MASK_TIM2_SMCR_MSM       0x80

#define MASK_TIM2_ETR_ETF        0x0F
#define MASK_TIM2_ETR_ETPS       0x30
#define MASK_TIM2_ETR_ECE        0x40
#define MASK_TIM2_ETR_ETP        0x80

#define MASK_TIM2_IER_UIE        0x01
#define MASK_TIM2_IER_CC1IE      0x02
#define MASK_TIM2_IER_CC2IE      0x04
#define MASK_TIM2_IER_TIE        0x40
#define MASK_TIM2_IER_BIE        0x80

#define MASK_TIM2_SR1_UIF        0x01
#define MASK_TIM2_SR1_CC1IF      0x02
#define MASK_TIM2_SR1_CC2IF      0x04
#define MASK_TIM2_SR1_TIF        0x40
#define MASK_TIM2_SR1_BIF        0x80

#define MASK_TIM2_SR2_CC1OF      0x02
#define MASK_TIM2_SR2_CC2OF      0x04

